Missing Data
Duplicates
Outliers
sample
dummies

In [1]:
import numpy as np
import pandas as pd

## Handling Missing Data

In [2]:
from numpy import nan as NA

In [3]:
s = pd.Series([3, NA, 8, NA, 5])
s

0    3.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

In [4]:
s.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [5]:
myser = s[s.notnull()]
myser

0    3.0
2    8.0
4    5.0
dtype: float64

In [6]:
s.dropna()

0    3.0
2    8.0
4    5.0
dtype: float64

In [ ]:
#

In [7]:
df = pd.DataFrame([[4, 9, 5], [2, NA, NA], [NA, NA, NA], [NA, 8, 6]])
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [8]:
cleaned = df.dropna()
cleaned

     0    1    2
0  4.0  9.0  5.0

In [9]:
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [10]:
df.dropna(how='all')

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
3  NaN  8.0  6.0

In [11]:
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [12]:
df[4] = NA
df

     0    1    2   4
0  4.0  9.0  5.0 NaN
1  2.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  8.0  6.0 NaN

In [13]:
df.dropna(axis=1, how='all')

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [ ]:
#

In [14]:
d = [[14, NA, NA], [12, NA, NA], [18, NA, 7], [18, NA, 16], [15, 12, 19], [13, 1, 6]]
df = pd.DataFrame(d)
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [15]:
df.dropna()

    0     1     2
4  15  12.0  19.0
5  13   1.0   6.0

In [16]:
df.dropna(thresh=2)

    0     1     2
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

### fillna : Filling In Missing Data

In [17]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [20]:
frame = df.fillna(0)
frame

    0     1     2
0  14   0.0   0.0
1  12   0.0   0.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [19]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [21]:
df.fillna({1: 0, 2: 9})

    0     1     2
0  14   0.0   9.0
1  12   0.0   9.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [22]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [23]:
_ = df.fillna(0, inplace=True)

In [24]:
df

    0     1     2
0  14   0.0   0.0
1  12   0.0   0.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [ ]:
#

In [25]:
d = [[15, 12, 19], [13, 1, 6], [18, NA, 7], [18, NA, 16], [14, NA, NA], [12, NA, NA]]
df = pd.DataFrame(d)
df

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   NaN   7.0
3  18   NaN  16.0
4  14   NaN   NaN
5  12   NaN   NaN

In [26]:
df.fillna(method='ffill')

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   1.0   7.0
3  18   1.0  16.0
4  14   1.0  16.0
5  12   1.0  16.0

In [27]:
df.fillna(method='ffill', limit=3)

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   1.0   7.0
3  18   1.0  16.0
4  14   1.0  16.0
5  12   NaN  16.0

In [ ]:
#

In [28]:
s = pd.Series([6, NA, 4, NA, 5])
s

0    6.0
1    NaN
2    4.0
3    NaN
4    5.0
dtype: float64

In [29]:
s.mean()

5.0

In [30]:
s.fillna(s.mean())

0    6.0
1    5.0
2    4.0
3    5.0
4    5.0
dtype: float64

### drop_duplicates : Removing Duplicates

In [31]:
frame = pd.DataFrame({'col1': ['a', 'b', 'a', 'b', 'a', 'b', 'b'],
                      'col2': [1, 1, 2, 3, 3, 4, 4]})
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [32]:
frame.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [35]:
df = frame.drop_duplicates()
df

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4

In [34]:
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [36]:
frame.drop_duplicates(['col1'])

  col1  col2
0    a     1
1    b     1

In [37]:
frame.drop_duplicates(['col1'], keep='last')

  col1  col2
4    a     3
6    b     4

In [38]:
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [39]:
frame.drop_duplicates(['col2'])

  col1  col2
0    a     1
2    a     2
3    b     3
5    b     4

In [40]:
frame.drop_duplicates(['col2'], keep='last')

  col1  col2
1    b     1
2    a     2
4    a     3
6    b     4

### replace : Replacing Values

In [44]:
myser = pd.Series([13, 9, 20, 9, 18, 17])
myser

0    13
1     9
2    20
3     9
4    18
5    17
dtype: int64

In [45]:
myser.replace(9, np.nan)

0    13.0
1     NaN
2    20.0
3     NaN
4    18.0
5    17.0
dtype: float64

In [46]:
myser.replace({9: np.nan, 18: 0})

0    13.0
1     NaN
2    20.0
3     NaN
4     0.0
5    17.0
dtype: float64

In [47]:
myser.replace([9, 18], [np.nan, 0])

0    13.0
1     NaN
2    20.0
3     NaN
4     0.0
5    17.0
dtype: float64

### cut

In [48]:
score = [20, 8, 17, 10]
bins  = [0, 9, 15, 20]

In [49]:
c = pd.cut(score, bins)
c.categories

IntervalIndex([(0, 9], (9, 15], (15, 20]],
              closed='right',
              dtype='interval[int64]')

In [50]:
c

[(15, 20], (0, 9], (15, 20], (9, 15]]
Categories (3, interval[int64]): [(0, 9] < (9, 15] < (15, 20]]

In [51]:
c.codes

array([2, 0, 2, 1], dtype=int8)

In [52]:
pd.value_counts(c)

(15, 20]    2
(9, 15]     1
(0, 9]      1
dtype: int64

In [ ]:
#

In [53]:
score = [20, 8, 17, 10]
bins  = [0, 9, 15, 20]

x = pd.cut(score, bins, labels=["bad", "medium", "good" ])
x

['good', 'bad', 'good', 'medium']
Categories (3, object): ['bad' < 'medium' < 'good']

In [54]:
pd.value_counts(x)

good      2
medium    1
bad       1
dtype: int64

In [ ]:
#

In [55]:
ages = [20, 58, 24, 72, 100]
bins = [18, 25, 35, 60, 110]
x = pd.cut(ages, bins)
pd.value_counts(x)

(60, 110]    2
(18, 25]     2
(35, 60]     1
(25, 35]     0
dtype: int64

In [56]:
c= pd.cut(ages, bins, labels=['Youth', 'YoungAdult', 'MiddleAged', 'Senior'])
pd.value_counts(c)

Senior        2
Youth         2
MiddleAged    1
YoungAdult    0
dtype: int64

### Detecting Outliers

In [57]:
df = pd.DataFrame(np.random.randn(1000, 3))
df.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean     -0.000523     0.067232     0.016555
std       1.008584     1.002984     1.015915
min      -3.275078    -4.273096    -2.872518
25%      -0.673763    -0.567494    -0.628753
50%      -0.010131     0.095450     0.057257
75%       0.656847     0.726980     0.721803
max       2.782410     3.210111     3.172334

In [58]:
df.head()

          0         1         2
0 -1.243230 -1.093150 -1.017881
1 -1.014960  0.926503 -0.443880
2  0.391280  0.492767 -1.877118
3 -1.769692  1.014232 -0.767588
4 -0.555514  0.288437  0.699942

In [59]:
s = np.sign(df)
s.head()

     0    1    2
0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0
2  1.0  1.0 -1.0
3 -1.0  1.0 -1.0
4 -1.0  1.0  1.0

In [60]:
df[np.abs(df) > 3] = s * 3

In [61]:
df.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean     -0.000030     0.069079     0.016383
std       1.007053     0.993899     1.015393
min      -3.000000    -3.000000    -2.872518
25%      -0.673763    -0.567494    -0.628753
50%      -0.010131     0.095450     0.057257
75%       0.656847     0.726980     0.721803
max       2.782410     3.000000     3.000000

### take

In [62]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)))
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [65]:
p = np.random.permutation(4)
p

array([1, 0, 3, 2])

In [66]:
df.take(p)  # Return the elements in the given positional indices along an axis.

   0   1   2
1  3   4   5
0  0   1   2
3  9  10  11
2  6   7   8

### sample : return a random sample of items from an axis of object.

In [67]:
df = pd.DataFrame(np.arange(30).reshape((6, 5)))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [71]:
df.sample(n=2)

    0   1   2   3   4
3  15  16  17  18  19
4  20  21  22  23  24

In [75]:
s = pd.Series([15, 7, 12, 16])
s.sample(n=2)

2    12
1     7
dtype: int64

In [76]:
#

In [77]:
a = ['s1', 's2', 's3', 's4']
b = {'F1': [7, 4, 6, 0], 'F2': [2, 1, 3, 0],'F3': [9, 4, 1, 7]}
df = pd.DataFrame(data=b, index=a)
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [80]:
df.sample(n=2, random_state=1)

    F1  F2  F3
s4   0   0   7
s3   6   3   1

In [81]:
df.sample(n=2, weights='F3', random_state=1)

    F1  F2  F3
s1   7   2   9
s4   0   0   7

In [82]:
s

0    15
1     7
2    12
3    16
dtype: int64

In [85]:
s.sample(n=6, replace=True)

2    12
1     7
3    16
1     7
0    15
1     7
dtype: int64

In [87]:
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [86]:
df.sample(frac=0.5)

    F1  F2  F3
s3   6   3   1
s4   0   0   7

In [92]:
df.sample(frac=2, replace=True)

    F1  F2  F3
s3   6   3   1
s3   6   3   1
s2   4   1   4
s4   0   0   7
s3   6   3   1
s3   6   3   1
s1   7   2   9
s4   0   0   7

In [93]:
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [97]:
myser = df['F1'].sample(n=3)
myser

s1    7
s4    0
s3    6
Name: F1, dtype: int64

### get_dummies

In [98]:
s = pd.Series(list('abca'))
s

0    a
1    b
2    c
3    a
dtype: object

In [100]:
df = pd.get_dummies(s)
df

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [101]:
myser = pd.Series(list('abcaa'))
pd.get_dummies(myser)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0
4  1  0  0

In [102]:
lst = ['a', 'b', np.nan]
pd.get_dummies(lst)

   a  b
0  1  0
1  0  1
2  0  0

In [ ]:
#

In [103]:
df = pd.DataFrame({'F1': ['a', 'b', 'c'], 'F2': ['b', 'a', 'a'], 'F3': [7, 2, 3]})
df

  F1 F2  F3
0  a  b   7
1  b  a   2
2  c  a   3

In [105]:
type(df['F1'])

pandas.core.series.Series

In [104]:
pd.get_dummies(df['F1'])

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1

In [106]:
pd.get_dummies(df['F2'])

   a  b
0  0  1
1  1  0
2  1  0

In [108]:
df

  F1 F2  F3
0  a  b   7
1  b  a   2
2  c  a   3

In [107]:
pd.get_dummies(df)

   F3  F1_a  F1_b  F1_c  F2_a  F2_b
0   7     1     0     0     0     1
1   2     0     1     0     1     0
2   3     0     0     1     1     0

In [109]:
pd.get_dummies(df, prefix=['col1', 'col2'])

   F3  col1_a  col1_b  col1_c  col2_a  col2_b
0   7       1       0       0       0       1
1   2       0       1       0       1       0
2   3       0       0       1       1       0

In [110]:
d = pd.get_dummies(df['F1'])
d

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1

In [111]:
df

  F1 F2  F3
0  a  b   7
1  b  a   2
2  c  a   3

In [112]:
dfdummy = df[['F2','F3']].join(d)
dfdummy

  F2  F3  a  b  c
0  b   7  1  0  0
1  a   2  0  1  0
2  a   3  0  0  1